[{"name": "Multilingual support", "status": "Ongoing", "description": "Quotebot messages can now be in the language of your choice (currently in progress french, german, spanish, danish, filipino, finnish but more planned)."}, {"name": "Help command", "status": "Paused", "description": "/help, opens a help menu for commands (select from dropdown menu), quotebot faq."}, {"name": "Info command", "status": "Paused", "description": "Contains my contact, current qb stats and changelog (could be put in the help command tbd)"}, {"name": "Quote repair", "status": "Concept", "description": "Quotes will now be scanned for double quotation errors and automatically repair them (blessed be gpt)"}, {"name": "Quote editing", "status": "Concept", "description": "Finally added editing a quote /edit <user> for quote dropdown menu or reply to a quote msg with @quotebot edit <new-quote> to quickedit"}, {"name": "Context", "status": "Concept", "description": "You can specify context for a quote if you want. /add <user> <quote> [context]. or /context <user> gives you a dropdown menu. Select the quote and view, edit or add context"}, {"name": "Report command", "status": "Concept", "description": "/report <to-dev/to-staff> <user> <reason>, sends a report to me or an alert to mod alerts channel if set."}, {"name": "Block command", "status": "Concept", "description": "/block <user> to stop them from adding to your profile globally."}, {"name": "/profile changes", "status": "Completed", "description": "Profile now uses date added instead of username after each quote"}, {"name": "/delete changes", "status": "Completed", "description": "Now uses a dropdown menu to select the quote you want to remove. /delete <user>"}, {"name": "/setchannel change", "status": "Completed", "description": "You can now unset the channel. Why didn't I add this before, my bad I forgot"}, {"name": "/quote change", "status": "Completed", "description": "Uses a dropdown menu if you want to send a specific quote, leave blank if you want a random quote"}, {"name": "/add change", "status": "Concept", "description": "Adds a Custom option to user selection dropdown which allows users to input a custom username. These users are added to the user dropdown menus in all menus and have custom pfp? Idk but basically they become fake users only available in that server."}, {"name": "Settings command", "status": "Ongoing", "description": "/settings, set channels for certain qb messages, alerts or logs. Edit auto actions. Toggle community mode. (all explained later)"}, {"name": "Add Settings", "status": "Ongoing", "description": "Settings for how often, what channel, and who can add quotes"}, {"name": "Delete Settings", "status": "Planned", "description": "Settings for only quotes they've added, how often, what channel and who can remove quotes"}, {"name": "Edit Settings", "status": "Planned", "description": "Settings for only quotes they've added, how often, and what channel"}, {"name": "Safety Levels", "status": "Concept", "description": "Presets: Safe, Moderate, Low. Safe means block everything but swears, Moderate is block slurs and hate speech, Low is I don't really know yet. You can also do Custom which means you toggle what you want and don't want auto-detected"}, {"name": "Mod Alerts", "status": "Concept", "description": "If something is detected it can be sent to an alerts channel or can be held for review by a human. (enabled in actions)"}, {"name": "Actions", "status": "Concept", "description": "Part of safety levels is what it should do if something is detected. You can toggle these for each detection or global defaults. Alert mods, Hold for review, Mark NSFW, Block Add"}, {"name": "Logs", "status": "Planned", "description": "Added logs back so adds, deletes, edits and punishments are logged to a channel. Using /history <user> will open a logs menu to browse a user's logs."}, {"name": "Server blacklist", "status": "Concept", "description": "Servers can ban users from interacting with qb on their server."}, {"name": "Profile Lock", "status": "Concept", "description": "Servers can lock profiles to prevent them from being modified (wip)"}, {"name": "Review", "status": "Concept", "description": "Mods can use /review <user> to see a user's quotes, remove them or ban them"}, {"name": "Achievement Badges", "status": "Concept", "description": "Set up the badges section on profile. Hard because I'd need to choose what the achievements are and and design how they look like."}, {"name": "Buy me a coffee link somewhere", "status": "Planned", "description": "Add a link for users to buy me a coffee"}, {"name": "Private quote storage in dms", "status": "Concept", "description": "For whoever you want with @QuoteBot add <custom-name> <quote> [context], @Quotebot delete and @Quotebot edit"}, {"name": "/scan command", "status": "Paused", "description": "Scans the channel history for quote messages in a \"\" -name format or similar. Using an LLM perhaps? A little bit of GPT magic?"}, {"name": "Convert to display name", "status": "Paused", "description": "Convert all instances of user to user.display_name, since discord changed their usernames now and qb is a server specific bot."}, {"name": "Interaction Protection", "status": "Concept", "description": "implement test case for if an interaction was done by the interaction author, if not simply ignore the interaction and continue waiting."}, {"name": "Update quote queries", "status": "Concept", "description": "Go through and make it so database queries to the quotes table are always sorted in chronological order."}, {"name": "LLM Filter", "status": "Paused", "description": "Use a language model as a filter to be able to understand inuendos, detect obfuscation, or otherwise detect softcore NSFW content that doesn't trip the word filter."}, {"name": "Embed Authors", "status": "Concept", "description": "Go through the embeds of quotebot and ensure that the author logic makes sense with uses/target relationships. For example: using the user as the author in the delete command since it addrese them, but using the target in add because it simulates the quote format. "}, {"name": "POST stats", "status": "Concept", "description": "Setup automatic task to post QuoteBot server count to topgg and dblist every day"}, {"name": "Secure callbacks", "status": "Concept", "description": "Go through every view object/interaction with view objects (buttons, dropdowns, etc) and make it so their custom IDs use the following format: qb-<action>-<5-random-characters>. This is to ensure that backend callbacks are unlikely to be added as quotes."}]